pascal-3.2/tutorials/surfaceTracking/interTrackMHDFoam/tank3D/constant/trackedSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      trackedSurfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoFluids no;

cleanInterface yes;

normalMotionDir no;

motionDir (0 0 1);

fixedTrackedSurfacePatches 0( );

pointNormalsCorrectionPatches 4(side-1 side-2 symm-1 symm-2);

nTrackedSurfaceCorrectors 1;

smoothing yes;

// ************************************************************************* //
